#+setupfile: ~/.config/hax-config/emacs/latex-export-header.org
#+author: Артемов Максим ИВБО-02-18
#+title: Отчет по работам 1-4 по дисциплине "ОиХД"
#+email: maxiartem@gmail.com

#+OPTIONS: toc:nil
\begin{abstract}
Предметная область - разработка ПО
\end{abstract}
#+TOC: headlines 3


** Пример файла для обработки

Файл использованный в качестве тестового для примеров:

#+include: "example.nim" src nim

Таблица ~procs~ базы данный после обработки исходного файла
#+begin_src sqlite :db /tmp/db-1.sqlite :results output verbatim :exports output
.mode column
.headers on
.nullvalue NULL
SELECT * FROM procs;
#+end_src

#+RESULTS:
: procid      procname    moduleid    docstring   rettype     kind
: ----------  ----------  ----------  ----------  ----------  ----------
: 1           helloWorld  NULL                    cfloat      pkProc
: 2           getSign     NULL                    int         pkProc
: 3           name        NULL                    string      pkProc
: 4           secondName  NULL                    string      pkProc

Таблица ~arguments~ базы данный после обработки исходного файла
#+begin_src sqlite :db /tmp/db-1.sqlite :results output verbatim :exports output
.mode column
.headers on
.nullvalue NULL
SELECT * FROM arguments;
#+end_src


#+RESULTS:
: procid      arg         type        idx         defval
: ----------  ----------  ----------  ----------  ----------
: 1           arg         cfloat      0           NULL
: 2           a1          string      0           NULL
: 2           a2          string      1           NULL
: 2           a3          int         2           NULL
: 3           o           Object      0           NULL
: 4           o           Object      0           NULL


